TOKEN = '1994491516:AAFW-bYws7JkmJx1CzOfDzA7YvuwdIkT9JA' # already updated :D
AUTHOR = 'https://github.com/thermazote'
BOT_LINK = 'https://t.me/VSTUScheduleBot'

WELCOME = '<b>Привет ✌🏻</b>\n\n\
<i>UPD: Бот переехал c polling на webhook. В разы увеличилась стабильность бота.</i>\n\n\
<b>Список команд:</b>\n\
/today - Расписание на сегодня\n/tomorrow - Расписание на завтра\n/week - Расписание на текущую неделю\n\
/firstweek - Расписание на первую неделю\n/secondweek - Расписание на вторую неделю\n\n\
<b>Условные обозначения:</b>\n\
🟢 - Лекционное занятие\n\
🟡 - Практическое занятие\n\
🟣 - Лабораторная работа\n\n\
Обновить расписание, предложить функцию - @thermazote'

FIRSTWEEK = [\
'<b><u>Понедельник (I)</u></b>\n\
<code>Выходной</code>',\
'<b><u>Вторник (I)</u></b>\n\
<code>\
🟣 08:30-11:40\n\
Комп.Линг.| Методы Оптим.\n\
В-1402-1  | В-1402-3\n\n\
🟣 11:50-15:10\n\
Методы Оптим.| Комп.Линг.\n\
В-1402-3     | В-1402-1\
</code>',\
'<b><u>Среда (I)</u></b>\n\
<code>\
🟢 10:10-11:40\n\
Сети И Телекоммун.\n\
Дист.\n\n\
🟢 11:50-13:20\n\
БЖД\n\
Дист.\n\n\
🟢 13:40-15:10\n\
Методы Оптим.\n\
Дист.\
</code>',\
'<b><u>Четверг (I)</u></b>\n\
<code>\
🟣 08:30-11:40\n\
МиВ ОС | ______\n\
В-1303 |\n\n\
🟣 11:50-15:10\n\
______ | МиВ ОС\n\
       | В-1303\
</code>',\
'<b><u>Пятница (I)</u></b>\n\
<code>\
🟢 13:40-15:10\n\
Методы ППР\n\
В-1301\n\n\
🟡 15:20-16:50\n\
Методы ППР\n\
В-1301\
</code>',\
'<b><u>Суббота (I)</u></b>\n\
<code>\
🟢 08:30-10:00\n\
Комп.Линг.\n\
Дист.\n\n\
🟢 10:10-11:40\n\
Комп.Линг.\n\
Дист.\n\n\
🟢 11:50-13:20\n\
Методы Оптим.\n\
Дист.\n\n\
🟢 13:40-15:10\n\
Сети И Телекоммун.\n\
Дист.\
</code>',\
'<b><u>Воскресенье (I)</u></b>\n\
<code>Выходной</code>']

SECONDWEEK = [\
'<b><u>Понедельник (II)</u></b>\n\
<code>\
🟣 08:30-11:40\n\
Основы СПО | Сети И Телекоммун.\n\
В-1302     | В-1303\n\n\
🟣 11:50-15:10\n\
Сети И Телекоммун. | Основы СПО\n\
В-1303             | В-1302\
</code>',\
'<b><u>Вторник (II)</u></b>\n\
<code>\
🟡 08:30-10:00\n\
Физ.Культура\n\
СЗ\n\n\
🟡 10:10-11:40\n\
Физ.Культура\n\
СЗ\
</code>',\
'<b><u>Среда (II)</u></b>\n\
<code>\
🟣 15:20-18:30\n\
Методы ППР | Методы ППР\n\
В-1301    | В-1301\n\
8.09, 6.10| 22.09, 20.10\n\
3.11, 1.12| 17.11, 15.12\
</code>',\
'<b><u>Четверг (II)</u></b>\n\
<code>\
🟢 08:30-10:00\n\
Методы ППР\n\
В-1301\n\n\
🟡 10:10-11:40\n\
Физ.Культура\n\
СЗ\n\n\
🟡 11:50-13:20\n\
БЖД\n\
Б-402\n\n\
🟡 13:40-15:10\n\
Методы Оптим.\n\
В-1401\n\n\
</code>',\
'<b><u>Пятница (II)</u></b>\n\
<code>\
🟢 10:10-11:40\n\
Сети И Телекоммун.\n\
Дист.\n\n\
🟢 11:50-13:20\n\
Основы СПО\n\
Дист.\n\n\
🟢 13:40-15:10\n\
МиВ ОС\n\
Дист.\
</code>',\
'<b><u>Суббота (II)</u></b>\n\
<code>Выходной</code>',\
'<b><u>Воскресенье (II)</u></b>\n\
<code>Выходной</code>']
